{
	"id" 			: 	"RPR-WARFARE-2.0",
	"version"		:	"0.1",
	"name" 			: 	"RPR-WARFARE-2.0",
	"description"	:	"Basic Handling of the RPR FOM Warfare Module. This module defines the interaction classes related to weapons, expendables, and to any type of explosion whether or not it is related to munitions. The Warfare module depends on the Base module for datatype definitions.",
	"graphics"		:	"RPR-WARFARE-2.0.png",
	"dependency"	:	[],
	"requirements"	:	[
		{
			"id"			:	"IR-RPR2-0017",
			"description"	:	"SuT shall define BaseEntity.PhysicalEntity.Munition or at least one leaf object class as published or subscribed in CS/FOM when tracked munitions is used (e.g. torpedoes, missiles, etc.)"
		},
		{
			"id"			:	"IR-RPR2-0018",
			"description"	:	"SuT shall define interaction class WeaponFire or at least one leaf class as published and/or subscribed in CS/SOM."
		},
		{
			"id"			:	"IR-RPR2-0019",
			"description"	:	"SuT shall provide the following required parameters for the WeaponFire interaction: EventIdentifier, FiringLocation, FiringObjectIdentifier, FuseType, InitialVelocityVector, MunitionType, WarheadType."
		},
		{
			"id"			:	"IR-RPR2-0020",
			"description"	:	"SuT shall when tracked munition is used provide the WeaponFire parameter MunitionObjectIdentifier."
		},
		{
			"id"			:	"IR-RPR2-0021",
			"description"	:	"SuT shall provide parameters for sent interactions of WeaponFire and subclasses according to SISO-STD-001-2015 and SISO-STD-001.1-2015."
		},
		{
			"id"			:	"IR-RPR2-0022",
			"description"	:	"SuT shall assume default values for optional parameters at interactions of WeaponFire and subclasses according to SISO-STD-001-2015."
		},
		{
			"id"			:	"IR-RPR2-0023",
			"description"	:	"SuT shall not rely on receiving optional parameters on interactions of WeaponFire and subclasses."
		},
		{
			"id"			:	"IR-RPR2-0024",
			"description"	:	"SuT shall define interaction class MunitionDetonation or at least one leaf class as published and/or subscribed in CS/SOM."
		},
		{
			"id"			:	"IR-RPR2-0025",
			"description"	:	"SuT shall provide the following required parameters for the MunitionDetonation interaction: DetonationLocation, EventIdentifier, FuseType, MunitionType, WarheadType."
		},
		{
			"id"			:	"IR-RPR2-0026",
			"description"	:	"SuT shall when munition type is not a mine provide the following required parameters for the MunitionDetonation interaction if: FiringObjectIdentifier, FinalVelocityVector."
		},
		{
			"id"			:	"IR-RPR2-0027",
			"description"	:	"SuT shall when tracked munition is used provide the MunitionDetonation parameter MunitionObjectIdentifier."
		},
		{
			"id"			:	"IR-RPR2-0028",
			"description"	:	"SuT shall when the parameter TargetObjectIdentifier at MunitionDetonation is provided, provide the parameter RelativeDetonationLocation."
		},
		{
			"id"			:	"IR-RPR2-0029",
			"description"	:	"SuT shall provide parameters for sent interactions of MunitionDetonation and subclasses according to SISO-STD-001-2015 and SISO-STD-001.1-2015."
		},
		{
			"id"			:	"IR-RPR2-0030",
			"description"	:	"SuT shall assume default values for optional parameters on interactions of MunitionDetonation and subclasses according to SISO-STD-001-2015."
		},
		{
			"id"			:	"IR-RPR2-0031",
			"description"	:	"SuT shall not rely on receiving optional parameters on interactions of MunitionDetonation and subclasses."
		},
		{
			"id"			:	"IR-RPR2-0032",
			"description"	:	"SuT shall when munition type was not a mine provide the same value on parameter EventIdentifier at the WeaponFire and the corresponding MunitionDetonation interaction."
		},
		{
			"id"			:	"IR-RPR2-0033",
			"description"	:	"SuT shall when receiving a MunitionDetonation interaction with a specified target (Direct Fire) and SuT has the modelling responsibility for the damage assessment at that entity, update the BaseEntity.PhysicalEntity attribute DamageState with an appropriate value."
		},
		{
			"id"			:	"IR-RPR2-0034",
			"description"	:	"SuT shall when receiving a MunitionDetonation without a specified target (Indirect Fire) but the same location as an entity and SuT has the modelling responsibility for the damage assessment at that entity, update the BaseEntity.PhysicalEntity attribute DamageState with an appropriate value."
		}
	]
}
